Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: First, if it isn’t yet clear, Git is fundamentally a content-addressable filesystem with a VCS user interface written on top of it.
es: Ante todo, por si no estuviera suficientemente claro ya, Git es fundamentalmente un sistema de archivo (filesystem) con un interface de usuario (VCS) escrito sobre él.

source: How can you keep your code consistently up to date and your patches valid?
es: ¿Cómo puedes mantener consistentemente actualizado tu código, y asegurarte así de que tus parches son válidos?

source: The first section of this chapter will cover the available protocols and the pros and cons of each.
es: La primera parte de este capítulo cubrirá la gama de protocolos disponibles, detallando los pros y contras de cada uno de ellos.

source: To add a local repository to an existing Git project, you can run something like this:
es: Para añadir un repositorio local a un proyecto Git existente, puedes usar algo como:

source: In this case, the master branch pull was rejected because it wasn’t a fast-forward reference.
es: En este ejemplo, se ha rechazado la recuperación de la rama master porque no era una referencia de avance rápido (fast-forward).

source: Either the Git repository is available for everyone to clone or it isn’t.
es: O el repositorio está disponible para que cualquiera lo pueda clonar, o no lo está.

source: Git is smart enough to figure out what commit you meant to type if you provide the first few characters, as long as your partial SHA-1 is at least four characters long and unambiguous — that is, only one object in the current repository begins with that partial SHA-1.
es: Simplemente dándole los primeros caracteres del código SHA-1, Git es lo suficientemente inteligente como para figurarse cual es la confirmación de cambios (commit) deseada. Es necesario teclear por lo menos 4 caracteres y estos han de ser no ambiguos --es decir, debe existir un solo objeto en el repositorio cuyo código comience por dicho trozo inicial del SHA--.

source: If you’re not interested in using KDiff3 for diff but rather want to use it just for merge resolution, and the kdiff3 command is in your path, then you can run
es: Por ejemplo, si no te interesa utilizar KDiff3 para comparaciones, sino que tan solo te interesa utilizarlo para resolver conflictos de integración; teniendo kdiff3 en el path de ejecución, solo has de lanzar el comando:

source: If you want to remove the "added cat-file" commit and change the order in which the other two commits are introduced, you can change the rebase script from this
es: Por ejemplo, si se desea eliminar la confirmación de "added cat-file" y cambiar el orden en que se han introducido las otras dos confirmaciones de cambios, el script de reorganización pasaría de ser:

source: Examples include e-mailing a list, notifying a continuous integration server, or updating a ticket-tracking system — you can even parse the commit messages to see if any tickets need to be opened, modified, or closed.
es: Algunos ejemplos de posibles aplicaciones pueden ser la de alimentar una lista de correo-e, avisar a un servidor de integración continua, o actualizar un sistema de seguimiento de tickets de servicio --pudiendo incluso procesar el mensaje de confirmación para ver si hemos de abrir, modificar o dar por cerrado algún ticket--.

source: In the last section of this chapter, I’ll demonstrate using this hook to check that your commit message is conformant to a required pattern.
es: En la última parte de este capítulo, veremos cómo podemos utilizar este punto de enganche para revisar si el mensaje de confirmación es conforme a un determinado patrón obligatorio.

source: If you and a co-worker are working on the same project and they want you to check something out, running a command like `git pull /home/john/project` is often easier than them pushing to a remote server and you pulling down.
es: Si tu y otra persona estais trabajando en el mismo proyecto y ella quiere mostrarte algo, el usar un comando tal como 'git pull /home/john/project' suele ser más sencillo que el que esa persona te lo envie (push) a un servidor remoto y luego tú lo recojas (pull) desde allí.

source: # on Johns computer $ cd myproject $ git init $ git add .
es: # en la máquina de John $ cd myproject $ git init $ git add .

source: Git doesn’t have a modify-history tool, but you can use the rebase tool to rebase a series of commits onto the HEAD they were originally based on instead of moving them to another one.
es: Git no dispone de herramientas directas para modifica el historial de confirmaciones de cambio. Pero es posible emplear la herramienta de reorganización (rebase) para modificar series de confirmaciones; en la propia cabeza (HEAD) donde estaban basadas originalmente, en lugar de moverlas a otra distinta.

source: Your local branches aren’t automatically synchronized to the remotes you write to — you have to explicitly push the branches you want to share.
es: Tus ramas locales no se sincronizan automáticamente con los remotos en los que escribes. Sino que tienes que llevar (push) expresamente, cada vez, al remoto las ramas que desees compartir.

source: Now, Git will check the integrity of your repository before each push is accepted to make sure faulty clients aren’t introducing corrupt data.
es: A partir de ese momento, Git comprobará la integridad del repositorio antes de aceptar ningún envio (push), para asegurarse de que no está introduciendo datos corruptos.

source: If you run that, Git will page the entire output of all commands, no matter how long they are.
es: Si lanzas esto, Git mostrará siempre el resultado completo de todos los comandos, independientemente de lo largo que sea este.

source: ### External Merge and Diff Tools ###
es: ### Herramientas externas para fusionar y para comparar ###

source: Jessica, Josie, and John inform the integrators that the `featureA` and `featureBee` branches on the server are ready for integration into the mainline.
es: Jessica, Josie y John informan a los integradores de que las ramas 'featureA' y 'featureBee' del servidor están preparadas para su integración con la línea principal del programa.

source: If someone has e-mailed you the patch properly using git send-email, and you download that into an mbox format, then you can point git am to that mbox file, and it will start applying all the patches it sees.
es: Si alguien te ha enviado correctamente un parche utilizando 'git send-email', y te lo has descargado a un formato mbox; podrás indicar dicho archivo mbox al comando 'git am', y este comenzará a incorporar todos los parches que encuentre dentro.

source: Insert 18333fig0903.png Figure 9-3.
es: Insert 18333fig0903.png Figura 9-3.

source: The `--ignore-unmatch` option to `git rm` tells it not to error out if the pattern you’re trying to remove isn’t there.
es: La opción `--ignore-unmatch` indica a `git rm` que evite lanzar errores en caso de no encontrar el patrón que le has ordenado buscar.

source: These commands are generally referred to as "plumbing" commands, and the more user-friendly commands are called "porcelain" commands.
es: Estos comandos son conocidos como los "comandos de fontanería", mientras que los comandos más amigables son conocidos como los "comandos de porcelana".

source: What is also interesting is that the second version of the file is the one that is stored intact, whereas the original version is stored as a delta — this is because you’re most likely to need faster access to the most recent version of the file.
es: Resulta curioso que se almacene completa la segunda versión del archivo, mientras que la versión original es donde se almacena solo la diferencia. Esto se debe a la mayor probabilidad de que vayamos a recuperar rápidamente la versión mas reciente del archivo.

source: You can tell Git to convert CRLF to LF on commit but not the other way around by setting `core.autocrlf` to input:
es: Puedes indicar a Git que convierta CRLF en LF al confirmar cambios (commit), pero no en el otro sentido; utilizando también el parámetro 'core.autocrlf':

source: Git successfully and succinctly tells me that I added the string "Let’s see if this works", which is correct.
es: Git me indica correctamente que he añadido la frase "Let's see if this works".

source: A lot of people become concerned at some point that they will, by random happenstance, have two objects in their repository that hash to the same SHA-1 value.
es: Mucha gente se suele preocupar por si, por casualidad, dos objetos en su repositorio reciben el mismo código SHA-1 para identificarlos.

source: Insert 18333fig0525.png Figure 5-25.
es: Insert 18333fig0525.png Figura 5-25.

source: There is only one packfile on the server, so your object is obviously in there, but you’ll check the index file to make sure.
es: Vemos que hay un archivo empaquetado, y el objeto buscado ha de encontrarse dentro de él; pero merece comprobarlo revisando el archivo de índice, para asegurarse.

source: Basically, all you have to do is put the bare Git repository under your HTTP document root and set up a specific `post-update` hook, and you’re done (See Chapter 7 for details on Git hooks).
es: Basta con situar el repositorio Git bajo la raiz de los documentos HTTP y preparar el enganche (hook) 'post-update' adecuado. (Ver el Capítulo 7 para detalles sobre los enganches Git.)

source: Instead of just moving the branch pointer forward, Git creates a new snapshot that results from this three-way merge and automatically creates a new commit that points to it (see Figure 3-17).
es: En lugar de simplemente avanzar el apuntador de la rama, Git crea una nueva instantánea (snapshot) resultante de la fusión a tres bandas; y crea automáticamente una nueva confirmación de cambios (commit) que apunta a ella.

source: In the next chapter, you’ll learn more powerful tools and tips for dealing with complex situations, which will truly make you a Git master.
es: En el capítulo siguiente, aprenderás el uso de más herramientas avanzadas y algunos trucos para tratar con situaciones complejas; haciendo de tí un verdadero maestro Git.

source: Do work on a web site.
es: Trabajas en un sitio web.

source: Your commit history looks like Figure 3-36.
es: Tu registro de cambios puede ser algo como lo de la Figura 3-36.

source: Generally, eight to ten characters are more than enough to be unique within a project.
es: Normalmente, entre ocho y diez caracteres suelen ser más que suficientes para garantizar la unicidad de todos los objetos dentro de cualquier proyecto.

source: If you’re happy with that, and you verify that everything that had conflicts has been staged, you can type `git commit` to finalize the merge commit.
es: Si todo ha ido correctamente, y ves que todos los archivos conflictivos están marcados como preparados, puedes lanzar el comando 'git commit' para terminar de confirmar la fusión.

source: You can then use `git cat-file` to see how big that object is:
es: Y ver su tamaño con el comando `git cat-file`:

source: For future projects, you can also copy collaborator groups by copying the permissions of an existing project.
es: En proyectos futuros, podras incluir también a tu grupo de colaboradores copiando los permisos desde otro proyecto ya existente.

source: If you want Git to check object consistency on every push, you can force it to do so by setting `receive.fsckObjects` to true:
es: De todas formas, si deseas que Git compruebe la consistencia de todos los objetos en todos los envios, puedes forzarle a hacerlo ajustando a 'true' el parámetro 'receive.fsckObjects':

source: Git can transfer data between two repositories in two major ways: over HTTP and via the so-called smart protocols used in the `file://`, `ssh://`, and `git://` transports.
es: Git puede transferir datos entre dos repositorios utilizando uno de sus dos principales mecanismos de transporte: sobre HTTP (protocolo tonto), o sobre los denominados protocolos inteligentes (utilizados en `file://`, `ssh://` o `git://`).

source: You can pull the content back out of Git with the `cat-file` command.
es: Puedes volver a recuperar los contenidos usando el comando 'cat-file'.

source: If you edit that file manually, it remains like that until the next successful push to the `gitosis-admin` project.
es: Si lo editas manualmente, permanecerá como lo dejes; hasta el próximo envio (push) al proyecto 'gitosis-admin'.

source: Your history then looks like Figure 3-21.
es: El registro será algo parecido a la Figura 3-21.

source: Don’t include any commit you’ve already pushed to a central server — doing so will confuse other developers by providing an alternate version of the same change.
es: Por tanto, es importante no afectar a ninguna confirmación de cambios que haya sido ya enviada (push) a un servidor central. So pena de confundir a otros desarrolladores, a los cuales se estaria dando una versión alternativa de un mismo cambio.

source: The git branch command only created a new branch — it didn’t switch to that branch (see Figure 3-5).
es: Puesto que el comando git branch solamente crea una nueva rama, y no salta a dicha rama.

source: You need to be careful with this technique because amending changes the SHA-1 of the commit.
es: Es importante ser cuidadoso con esta técnica. Porque al modifcar cualquier confirmación de cambios, cambia también su código SHA-1.

source: This denies branch and tag deletion over a push across the board — no user can do it.
es: Esto impide el borrado de ramas o de etiquetas por medio de un envio a través de la mesa (push across the board), --ningún usuario lo podrá hacer--.

source: That is, you’ll learn how to contribute code successfully to a project and make it as easy on you and the project maintainer as possible, and also how to maintain a project successfully with a number of developers contributing.
es: Es decir, aprenderás cómo contribuir adecuadamente a un proyecto; de la forma más efectiva posible, tanto para tí, como para quien gestione el proyecto. Y aprenderás también a gestionar proyectos en los que colaboren multiples desarrolladores.

source: In this case, database.xml stays at whatever version you originally had.
es: Y el archivo database.xml permanecerá inalterado en cualquier que fuera la versión que tú tenias originalmente.

source: This way, you can make sure your commits are logically separate changesets and can be easily reviewed by the developers working with you.
es: Así, se consiguen unas confirmaciones de cambio con agrupaciones lógicas de modificaciones, facilitando su revisión por parte otros desarrolladores que trabajen con nosotros.

source: At this point, you’re ready to start the walking process.
es: sus ramas al espacio de nombres `qa/`En este punto, ya estás preparado para seguir procesando el resto de los objetos.

source: Thus, when you clone the Git repository, you have four branches that you can check out to evaluate the project in different stages of development, depending on how cutting edge you want to be or how you want to contribute; and the maintainer has a structured workflow to help them vet new contributions.
es: Así, cuando clonas el repositorio de Git, obtienes cuatro ramas que puedes recuperar (checkout); pudiendo evaluar el proyecto en distintos estadios de desarrollo, dependiendo de cuán avanzado desees estar o cómo desees contribuir. Y así, los gestores de mantenimiento disponen de un flujo de trabajo estructurado, para ayudarles en el procesado e incorporación de nuevas contribuciones.

source: While she waits for feedback from John, Jessica decides to start working on `featureB` with Josie.
es: Mientras espera noticias de John, Jessica decide comenzar a trabajar en la funcionalidad B (featureB) con Josie.

source: Git hasn’t automatically created a new merge commit.
es: Git no crea automáticamente una nueva fusión confirmada (merge commit).

source: Every time your branch tip is updated for any reason, Git stores that information for you in this temporary history.
es: Cada vez que se actualiza una rama por cualquier razón, Git almacena esa información en este histórico temporal.

source: These strategies are automatically chosen for you because the recursive strategy can handle complex three-way merge situations — for example, more than one common ancestor — but it can only handle merging two branches.
es: Estas son las estrategias escogidas por defecto, ya que la estrategia recursiva puede manejar complejas fusiones-de-tres-vias --por ejemplo, con más de un antecesor común-- pero tan solo puede fusionar dos ramas.

source: If you add a section for each repository, you can specify the ones from which you want your Git daemon to allow reading.
es: Añadiendo una sección por cada repositorio, puedes indicar a cuáles permitirá leer el demonio Git.

source: Resolving deltas: 100% (1952/1952), done.
es: Resolving deltas: 100% (1952/1952), done.Resolving deltas: 100% (1952/1952), done.Resolving deltas: 100% (1952/1952), done.

source: You can’t set a symbolic reference outside of the refs style:
es: Pero no puedes fijar una referencia simbólica fuera de "refs":

source: That’s why `git push` and `git pull` work out of the box with no other arguments.
es: Y es por eso que 'git push' y 'git pull' trabajan directamente, sin necesidad de más argumentos.

source: If she e-mails you again later with another branch containing another great feature, you can fetch and check out because you already have the remote setup.
es: Si más tarde vuelva a enviarte otro correo-e avisandote de otra gran funcionalidad que ha incorporado, puedes recuperarla (fetch y checkout) directamente, porque tienes el remoto ya definido.

source: As a general rule, your messages should start with a single line that’s no more than about 50 characters and that describes the changeset concisely, followed by a blank line, followed by a more detailed explanation.
es: Como regla general, tus mensajes han de comenzar con una ĺínea, de no más de 50 caracteres, donde se resuma el grupo de cambios; seguida de una línea en blanco; y seguida de una detallada explicación en las líneas siguientes.

source: Switch back to your original story and continue working.
es: Vuelves a la rama del tema en que andabas antes de la llamada y continuas tu trabajo.

source: If you follow all the internal pointers, you get an object graph something like Figure 9-3.
es: Siguiendo todos los enlaces internos, puedes llegar a un gráfico similar al de la figura 9-3.

source: This concept is true in Git as it is in Subversion (or any CVCS), and this model works perfectly in Git.
es: Este concepto es también válido en Git, tanto como en Subversion (o cualquier otro CVCS), y puede ser perfectamente utilizado en Git.

source: You have a lot of options at this point.
es: En estas preguntas, hay varias opciones de respuesta.

source: Another interesting example gets `$Date$` keyword expansion, RCS style.
es: Otro ejemplo interesante es el de poder conseguir una expansión de la clave '$Date$' del estilo de RCS.

source: #### Removing a File from Every Commit ####
es: #### Quitar un archivo de cada confirmación de cambios ####

source: Git attributes offers you two ways to do this.
es: Los atributos Git admiten dos maneras de realizarlo.

source: Let’s follow the `http-fetch` process for the simplegit library:
es: Vamos a revisar el proceso `http-fetch` para una libreria simple de Git:

source: If you already have a server to which all your developers have SSH access, it’s generally easiest to set up your first repository there, because you have to do almost no work (as we covered in the last section).
es: Si ya dispones de un servidor donde todos los desarrolladores tengan acceso SSH, te será facil colocar los repositorios en él (tal y como se verá en el próximo apartado).

source: Switched to a new branch "serverfix"
es: Switched to a new branch "serverfix"Switched to a new branch "serverfix"

source: That pulls down the work John has pushed up in the meantime.
es: Esto recupera el trabajo enviado por John durante el tiempo en que Jessica estaba trabajando.

source: You have to set it up.
es: Tienes que configurarlo tú mismo.

source: This is in sharp contrast to the way most VCS tools branch, which involves copying all of the project’s files into a second directory.
es: Esto contrasta fuertemente con los métodos de ramificación usados por otros sistemas de control de versiones. En los que crear una nueva rama supone el copiar todos los archivos del proyecto a una nueva carpeta adiccional.

source: To fork a project, visit the project page (in this case, mojombo/chronic) and click the "fork" button in the header (see Figure 4-14).
es: Para bifurcar un proyecto, visita su página (en el ejemplo, mojombo/chronic) y clica sobre el botón "fork" de su cabecera (ver Figura 4-14)

source: A common switch to use with the `log` command in this case is `--left-right`, which shows you which side of the range each commit is in.
es: Una opción habitual a utilizar en estos casos con el comando 'log' suele ser 'left-right'. Haciendo así que en la salida se muestre cual es el lado al que pertenece cada una de las confirmaciones de cambio.

source: You can read trees into your staging area by calling `read-tree`.
es: Para leer árboles al área de preparación puedes utilizar el comando `read-tree`.

source: A new text box appears, into which you can type a username.
es: Aparecerá un cuadro de texto, donde podrás teclear un nombre.

source: Although you can technically push changes to and pull changes from individuals’ repositories, doing so is discouraged because you can fairly easily confuse what they’re working on if you’re not careful.
es: Aunque técnicamente es posible enviar (push) y recibir (pull) cambios directamente a o desde repositorios individuales, no es muy recomendable trabajar así por la gran facilidad de confundirte si no andas con sumo cuidado.

source: Insert 18333fig0313.png Figure 3-13.
es: Insert 18333fig0313.png Figura 3-13.

source: Then, she can see what has been changed with `git log`:
es: A continuación, puede ver las modificaciones realizadas, lanzando el comando 'git log':

source: She’s created a topic branch called `issue54` and done three commits on that branch.
es: Ha creado una rama puntual denominada 'issue54' y ha realizado tres confirmaciones de cambios (commit) en dicha rama.

source: Insert 18333fig0702.png Figure 7-2.
es: Insert 18333fig0702.png Figura 7-2.

source: However, you can use namespacing to accomplish something like that.
es: Aunque, para conseguir algo similar, puedes utilizar los espacios de nombres .

source: The `cat` program is basically a no-op: it spits out the same data that it gets in.
es: El programa 'cat' es básicamente transparente: de él salen los mismos datos que entran.

source: You can modify that message with details about how you resolved the merge if you think it would be helpful to others looking at this merge in the future — why you did what you did, if it’s not obvious.
es: Puedes modificar este mensaje añadiendo detalles sobre cómo has resuelto la fusión, si lo consideras util para que otros entiendan esta fusión en un futuro. Se trata de indicar porqué has hecho lo que has hecho; a no ser que resulte obvio, claro está.

source: When people visit your project, they see this page.
es: Cuando la gente visite tu proyecto, verá esta página.

source: Insert 18333fig0508.png Figure 5-8.
es: Insert 18333fig0508.png Figura 5-8.

source: This commit is fine, and now Git has all the information it needs to determine where the issue was introduced.
es: Con esto el proceso de búsqueda se completa y Git tiene la información necesaria para determinar dónde comenzaron los problemas.

source: ## Rebasing ##
es: ## Reorganizando el trabajo realizado ##
